var data = {
  "set1":[
    {
      country: "010",
      visits: 2722.3,
      names: "Совет депутатов"
    },
    {
      country: "011",
      visits: 76907.4,
      names: "Администрация"
    },
    {
      country: "012",
      visits: 77670.7,
      names: "Управление по финансам"
    },
    {
      country: "041",
      visits: 240479,
      names: "Отдел архитектуры"
    },
    {
      country: "051",
      visits: 14349,
      names: "Счетная палата"
    },
    {
      country: "073",
      visits: 692064.5,
      names: "Управление образования"
    },
    {
      country: "075",
      visits: 32173.8,
      names: "Отдел молодежной политики и спорта"
    },
    {
      country: "084",
      visits: 94708,
      names: "Управление культуры"
    },
  ],
  "set2":[
    {
      country: "01",
      visits: 69058.1,
      names: "Общегосударственные вопросы"
    },
    {
      country: "02",
      visits: 8411.4,
      names: "Национальная оборона"
    },
    {
      country: "03",
      visits: 7356.4,
      names: "Национальная безопасность и правоохранительная деятельность"
    },
    {
      country: "04",
      visits: 15044.9,
      names: "Национальная экономика"
    },
    {
      country: "05",
      visits: 2526.1,
      names: "Жилищно-коммунальное хозяйство"
    },
    {
      country: "06",
      visits: 350.2,
      names: "Охрана окружающей среды"
    },
    {
      country: "07",
      visits: 693040.6,
      names: "Образование"
    },
    {
      country: "08",
      visits: 81157.2,
      names: "Культура, кинематография"
    },
    {
      country: "09",
      visits: 100.0,
      names: "Здравоохранение"
    },
    {
      country: "10",
      visits: 35668.9,
      names: "Социальная политика"
    },
    {
      country: "11",
      visits: 33978.7,
      names: "Физическая культура и спорт"
    },
    {
      country: "14",
      visits: 55037,
      names: "Межбюджетные трансферты"
    },
  ],
  "set3":[
    {country: "62 0 00 00000",
      visits: 25,
      names: 'Муниципальная программа "Развитие муниципальной службы администрации муниципального образования Октябрьский район Оренбургской области"'},
    {country: "63 0 00 00000",
      visits: 5287.4,
      names: 'Муниципальная программа "Экономическое развитие муниципального образования Октябрьский район Оренбургской области"'},
    {country: "64 0 00 00000",
      visits: 30,
      names: 'Муниципальная программа "Комплексные меры по противодействию злоупотреблению наркотиками и их незаконному обороту и обеспечению правопорядка на территории муниципального образования Октябрьский район Оренбургской области"'},
    {country: "66 0 00 00000",
      visits: 100,
      names: 'Муниципальная программа «Обеспечение медицинскими кадрами лечебно-профилактических учреждений муниципального образования Октябрьский район Оренбургской области»'},
    {country: "67 0 00 00000",
      visits: 94607.9,
      names: 'Муниципальная программа «Развитие культуры муниципального образования Октябрьский район Оренбургской области»'},
    {country: "68 0 00 00000",
      visits: 34252.8,
      names: 'Муниципальная программа "Развитие молодежной политики, физической культуры, спорта и туризма в муниципальном образовании Октябрьский район Оренбургской области"'},
    {country: "69 0 00 00000",
      visits: 23869.2,
      names: 'Муниципальная программа «Стимулирование развития жилищного строительства в муниципальном образовании Октябрьский район Оренбургской области»'},
    {country: "70 0 00 00000",
      visits: 689847.6,
      names: 'Муниципальная программа "Развитие системы образования муниципального образования Октябрьский район Оренбургской области"'},
    {country: "71 0 00 00000",
      visits: 15,
      names: 'Муниципальная программа «О комплексных мерах по профилактике терроризма и экстремизма на территории муниципального образования Октябрьский район Оренбургской области »'},
    {country: "72 0 00 00000",
      visits: 70556.6,
      names: 'Муниципальная программа "Управление муниципальными финансами муниципального образования Октябрьский район Оренбургской области"'},
    {country: "73 0 00 00000",
      visits: 60205.4,
      names: 'Муниципальная программа "Обеспечение деятельности Администрации муниципального образования Октябрьский район Оренбургской области"'},
    {country: "74 0 00 00000",
      visits: 7164.1,
      names: 'Муниципальная программа «Оказание поддержки социально ориентированным общественным организациям и отдельным категориям граждан муниципального образования Октябрьский район Оренбургской области»'},
    {country: "75 0 00 00000",
      visits: 5852.1,
      names: 'Муниципальная программа «Развитие сельского хозяйства и регулирование рынков сельскохозяйственной продукции, сырья и продовольствия муниципального образования Октябрьский район Оренбургской области»'},
    {country: "76 0 00 00000",
      visits: 5,
      names: 'Муниципальная программа "Повышение безопасности дорожного движения в муниципальном образовании Октябрьский район Оренбургской области"'},
    {country: "78 0 00 00000",
      visits: 9911.4,
      names: 'Непрограммные мероприятия'},
  ],
  "set4":[
    {
      country: "Ю1",
      visits: 101,
      names: 'Региональный проект "Россия - страна возможностей"'
    },
    {
      country: "Ю6",
      visits: 33769.45,
      names: 'Региональный проект "Педагоги и наставники"'
    },
    {
      country: "Ю3",
      visits: 3631.1,
      names: 'Приоритетный проект «Культура малой Родины»'
    }]
};

let arrBranch = [
['Общегосударственные вопросы', '69 058,1', '67 956,1', '3 943,2', '4 490,8', '6 355,2', '5 066,0', '5 484,5', '5 234,2', '9 538,8', '4 157,0', '4 241,0', '4 240,0', '5 951,9', '9 253,5'],
['Национальная оборона', '8 411,4', '7 227,6', '0,0', '0,0', '826,6', '1 655,9', '221,4', '413,4', '1 234,5', '134,6', '1 798,9', '160,0', '136,1', '646,2'],
['Национальная безопасность и правоохранительная деятельность', '7 356,4', '7 356,4', '382,1', '384,2', '754,7', '545,1', '701,8', '744,5', '437,1', '583,7', '922,3', '535,6', '458,4', '907,0'],
['Национальная экономика', '15 044,9', '14 483,8', '786,0', '748,4', '919,8', '1 406,1', '1 410,3', '1 198,9', '1 519,4', '893,5', '1 016,3', '802,6', '1 518,4', '2 264,0'],
['Жилищно-коммунальное хозяйство', '2 526,1', '2 526,1', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '2 526,1'],
['Охрана окружающей среды', '350,2', '84,7', '0,0', '0,0', '0,0', '0,0', '84,7', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0'],
['Образование', '693 040,6', '690 219,3', '41 334,8', '47 184,2', '45 083,2', '50 243,5', '72 705,7', '51 222,0', '35 088,0', '30 472,7', '146 273,2', '47 566,5', '45 510,1', '77 535,3'],
['Культура, кинематография', '81 157,2', '80 240,3', '4 854,8', '6 183,2', '6 129,3', '8 338,9', '8 276,8', '5 853,5', '6 594,2', '5 181,6', '5 993,1', '6 372,3', '5 694,8', '10 767,8'],
['Здравоохранение', '100,0', '100,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '90,0', '0,0', '0,0', '10,0'],
['Социальная политика', '35 668,9', '35 484,1', '1 180,5', '4 087,6', '1 654,8', '1 290,0', '1 399,4', '4 404,1', '1 218,3', '1 318,7', '1 803,1', '3 863,0', '1 302,3', '11 962,4'],
['Физическая культура и спорт', '33 978,7', '33 971,5', '2 000,1', '3 025,2', '1 908,7', '3 189,0', '2 665,0', '5 774,9', '1 684,3', '2 424,6', '2 226,3', '2 160,8', '1 606,3', '5 306,2'],
['Межбюджетные трансферты общего характера бюджетам бюджетной системы российской федерации', '55 037', '55 037,0', '10 760,0', '5 380,0', '5 380,0', '3 590,0', '3 590,0', '3 670,0', '3 630,0', '3 590,0', '3 708,0', '3 590,0', '3 590,0', '4 559,0']]

let arrGrbs = [
['Совет депутатов', '2 722,3', '2 722,3', '12,3', '66,8', '96,8', '81,5', '58,5', '65,1', '1 629,3', '55,4', '94,7', '81,4', '208,2', '272,3'],
['Администрация', '76 907,4', '73 974,1', '3 474,6', '4 224,5', '6 944,7', '7 465,3', '6 037,8', '5 828,0', '8 099,4', '4 681,1', '6 811,1', '4 419,9', '5 587,6', '10 400,2'],
['Управление по финансам', '77 670,7', '77 670,7', '12 517,4', '7 208,0', '7 380,4', '4 957,5', '5 475,1', '5 542,4', '6 515,0', '5 005,3', '5 115,0', '5 062,9', '5 977,0', '6 914,7'],
['Отдел архитектуры', '24 047,9', '23 868,7', '174,1', '2 688,3', '293,7', '269,0', '435,2', '2 804,1', '400,2', '197,0', '272,6', '2 794,2', '335,7', '13 204,7'],
['Счетная палата', '1 434,9', '1 434,5', '99,2', '92,9', '73,6', '87,6', '113,2', '124,1', '351,4', '11,2', '74,4', '99,0', '143,4', '164,6'],
['Управление образования', '692 064,5', '689 058,1', '41 071,0', '47 127,9', '45 126,4', '49 715,1', '72 639,2', '53 597,2', '35 135,2', '30 548,9', '146 509,5', '47 103,9', '44 451,0', '76 032,9'],
['Отдел молодежной политики и спорта', '32 173,8', '32 167,6', '2 043,6', '3 093,8', '1 945,4', '3 343,6', '2 683,8', '2 926,3', '1 719,3', '2 425,8', '2 226,9', '2 393,5', '1 992,5', '5 373,0'],
['Управление культуры', '94 708', '93 791,0', '5 849,3', '6 981,4', '7 151,3', '9 404,8', '9 096,8', '7 628,5', '7 094,9', '5 831,6', '6 968,1', '7 336,0', '7 073,0', '13 375,2']]

let arrProg = [
['Муниципальная программа "Развитие муниципальной службы администрации муниципального образования Октябрьский район Оренбургской области"', '25,0', '24,3', '0,0', '4,0', '0,0', '15,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '5,3'],
['Муниципальная программа "Экономическое развитие муниципального образования Октябрьский район Оренбургской области"', '5 287,4', '5 108,7', '320,5', '260,0', '268,7', '668,1', '410,8', '442,4', '541,9', '243,6', '330,8', '347,3', '541,8', '732,7'],
['Муниципальная программа "Комплексные меры по противодействию злоупотреблению наркотиками и их незаконному обороту и обеспечению правопорядка на территории муниципального образования Октябрьский район Оренбургской области"', '30,0', '30,0', '0,0', '0,0', '0,0', '3,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '12,0', '15,0'],
['Муниципальная программа "Обеспечение медицинскими кадрами лечебно-профилактических учреждений Октябрьского района Оренбургской области" ', '100,0', '100,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '90,0', '0,0', '0,0', '10,0'],
['Муниципальная программа «Развитие культуры муниципального образования Октябрьский район Оренбургской области»', '94 607,9', '93 691,0', '5 849,3', '6 981,4', '7 051,3', '9 404,8', '9 096,8', '7 628,5', '7 094,9', '5 831,6', '6 968,1', '7 336,0', '7 073,0', '13 375,2'],
['Муниципальная программа "Развитие молодежной политики, физической культуры, спорта и туризма в муниципальном образовании Октябрьский район Оренбургской области"', '34 252,8', '34 243,6', '2 003,6', '3 038,8', '1 910,4', '3 210,6', '2 673,8', '5 876,3', '1 719,3', '2 425,8', '2 226,9', '2 160,8', '1 704,5', '5 292,8'],
['Муниципальная программа «Стимулирование развития жилищного строительства в муниципальном образовании Октябрьский район Оренбургской области»', '23 869,2', '23 868,7', '174,1', '2 688,3', '293,7', '269,0', '435,2', '2 804,1', '400,2', '197,0', '272,6', '2 794,2', '335,7', '13 204,7'],
['Муниципальная программа "Развитие системы образования муниципального образования Октябрьский район Оренбургской области"', '689 847,6', '686 844,1', '41 111,0', '47 132,9', '45 161,4', '49 848,1', '72 649,2', '50 647,2', '35 135,2', '30 548,9', '146 453,5', '47 331,6', '44 739,0', '76 086,1'],
['Муниципальная программа «О комплексных мерах по профилактике терроризма и экстремизма на территории муниципального образования Октябрьский район Оренбургской области »', '15,0', '15,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '15,0'],
['Муниципальная программа "Управление муниципальными финансами муниципального образования Октябрьский район Оренбургской области"', '70 556,6', '70 556,6', '12 111,2', '6 457,9', '6 827,4', '4 374,7', '4 898,1', '4 928,6', '5 879,6', '4 414,0', '4 523,7', '4 466,8', '5 380,0', '6 294,6'],
['Муниципальная программа "Обеспечение деятельности Администрации муниципального образования Октябрьский район Оренбургской области"', '60 205,4', '58 837,9', '2 974,1', '3 847,0', '5 762,4', '4 839,3', '4 968,9', '4 710,6', '6 226,3', '4 009,7', '4 413,6', '3 898,7', '4 647,9', '8 539,0'],
['Муниципальная программа «Оказание поддержки социально ориентированным общественным организациям и отдельным категориям граждан муниципального образования Октябрьский район Оренбургской области»', '7 164,1', '7 164,1', '406,3', '750,1', '553,0', '582,8', '627,0', '613,8', '635,4', '591,3', '591,3', '596,1', '596,9', '620,1'],
['Муниципальная программа «Развитие сельского хозяйства и регулирование рынков сельскохозяйственной продукции, сырья и продовольствия муниципального образования Октябрьский район Оренбургской области»', '5 852,1', '5 470,3', '291,4', '323,1', '357,4', '453,1', '558,3', '450,7', '577,3', '359,8', '403,0', '194,3', '601,3', '900,7'],
['Муниципальная программа "Повышение безопасности дорожного движения в муниципальном образовании Октябрьский район Оренбургской области"', '5,0', '5,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '0,0', '5,0', '0,0', '0,0'],
['Непрограммные мероприятия', '9 911,4', '8 727,6', '0,0', '0,0', '826,6', '1 655,9', '221,4', '413,4', '2 734,5', '134,6', '1 798,9', '160,0', '136,1', '646,2']]
  
  let arrNP = [
    ['Ю1', 'Региональный проект «Россия- страна возможностей"', '101', '101', '100'],
    ['Ю6', 'Региональный проект «Педагоги и наставники"', '33769,5', '33769,45', '100'],
    ['Q3', 'Приоритетный проект «Культура малой Родины»', '3631,7', '3631,7', '100']]
  

  
    let tableExpenseGrbs = document.querySelector('#tableExpenseGrbs');
    let tableExpense = document.createElement('tbody')
    for (let subArr of arrGrbs) {
      let tr = document.createElement('tr');
      tr.classList.add('new-class')
      for (let elem of subArr) {
        let td = document.createElement('td');
        if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
        td.textContent = elem;
        tr.appendChild(td);
      }
      tableExpense.appendChild(tr);
    }
    tableExpenseGrbs.appendChild(tableExpense)
    
    let tableExpenseBranch = document.querySelector('#tableExpenseBranch');
    let tableExpense1 = document.createElement('tbody')
    for (let subArr of arrBranch) {
      let tr = document.createElement('tr');
      tr.classList.add('new-class')
      for (let elem of subArr) {
        let td = document.createElement('td');
        if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
        td.textContent = elem;
        tr.appendChild(td);
      }
      tableExpense1.appendChild(tr);
    }
    tableExpenseBranch.appendChild(tableExpense1)

    let tableExpenseProg = document.querySelector('#tableExpenseProg');
    let tableExpense2 = document.createElement('tbody')
    for (let subArr of arrProg) {
      let tr = document.createElement('tr');
      tr.classList.add('new-class')
      for (let elem of subArr) {
        let td = document.createElement('td');
        if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
        td.textContent = elem;
        tr.appendChild(td);
      }
      tableExpense2.appendChild(tr);
    }
    tableExpenseProg.appendChild(tableExpense2)

    let tableExpenseNP = document.querySelector('#tableExpenseNP');
    let tableExpense3 = document.createElement('tbody')
    for (let subArr of arrNP) {
      let tr = document.createElement('tr');
      tr.classList.add('new-class')
      for (let elem of subArr) {
        let td = document.createElement('td');
        if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
        td.textContent = elem;
        tr.appendChild(td);
      }
      tableExpense3.appendChild(tr);
    }
    tableExpenseNP.appendChild(tableExpense3)

document.getElementById('set1').addEventListener('click', function () { selectDataset('set1'); tableExpenseGrbs.style.display = "block"; tableExpenseBranch.style.display = "none"; tableExpenseProg.style.display = "none"; tableExpenseNP.style.display = "none"; photoNP.style.display = "none"});
document.getElementById('set2').addEventListener('click', function () { selectDataset('set2'); tableExpenseGrbs.style.display = "none"; tableExpenseBranch.style.display = "block"; tableExpenseProg.style.display = "none"; tableExpenseNP.style.display = "none"; photoNP.style.display = "none"});
document.getElementById('set3').addEventListener('click', function () { selectDataset('set3', 100000, 660000); tableExpenseGrbs.style.display = "none"; tableExpenseBranch.style.display = "none"; tableExpenseProg.style.display = "block"; tableExpenseNP.style.display = "none"; photoNP.style.display = "none"});
document.getElementById('set4').addEventListener('click', function () { selectDataset('set4', 3700, 33500, 0.005); tableExpenseGrbs.style.display = "none"; tableExpenseBranch.style.display = "none"; tableExpenseProg.style.display = "none"; tableExpenseNP.style.display = "block"; photoNP.style.display = "grid"});

/*button.addEventListener("click", function () {
  smoothly(element, "textContent", "Новое содержимое");
});*/



function selectDataset(set, a=82000, b=515000, d=0.005) {
  chart.invalidateRawData();
  chart.data = data[set];
  tablData = arr[set];
  axisBreak.startValue = a;
  axisBreak.endValue = b;
  axisBreak.breakSize = d;
  series.appear();
  chart.appear();
  console.log(set)
}

// Themes begin
am4core.useTheme(am4themes_animated);
// Themes end

var chart = am4core.create("expense", am4charts.XYChart);
//chart.hiddenState.properties.opacity = 0; // this creates initial fade-in
chart.language.locale = am4lang_ru_RU;

chart.data = data.set1;

var categoryAxis = chart.xAxes.push(new am4charts.CategoryAxis());
categoryAxis.renderer.grid.template.location = 0;
categoryAxis.dataFields.category = "country";
categoryAxis.renderer.minGridDistance = 40;
categoryAxis.fontSize = 11;

var valueAxis = chart.yAxes.push(new am4charts.ValueAxis());
valueAxis.min = 0;
//valueAxis.max = 530000;
valueAxis.strictMinMax = true;
valueAxis.renderer.minGridDistance = 30;
valueAxis.fontSize = 11;

// axis break
var axisBreak = valueAxis.axisBreaks.create();
axisBreak.startValue = 82000;
axisBreak.endValue = 515000;
axisBreak.breakSize = 0.005;

// make break expand on hover
var hoverState = axisBreak.states.create("hover");
hoverState.properties.breakSize = 1;
hoverState.properties.opacity = 0.1;
hoverState.transitionDuration = 1500;

axisBreak.defaultState.transitionDuration = 1000;

var series = chart.series.push(new am4charts.ColumnSeries());
series.dataFields.categoryX = "country";
series.dataFields.valueY = "visits";
series.dataFields.names = "names";
series.columns.template.tooltipText = "{names} - [bold]{valueY.value} тыс.руб.[/]";
series.columns.template.tooltipY = 0;
series.columns.template.strokeOpacity = 0;
series.startDuration = 1000;

// as by default columns of the same series are of the same color, we add adapter which takes colors from chart.colors color set
series.columns.template.adapter.add("fill", function(fill, target) {
  return chart.colors.getIndex(target.dataItem.index);
});