let table1 = document.querySelector('.new1');
		
		arr2 = [
		['Октябрьский район', '975 359,21', '980 059,21'],
        ['Белозерский сельсовет', '5 820,51', '5 987,94'],
        ['Булановский сельсовет', '8 382,61', '9 268,51'],
        ['Васильевский сельсовет', '5 580,11', '5 867,57'],
        ['Ильинский сельсовет', '4 431,81', '4 431,81'],
        ['Имангуловский сельсовет', '10 675,81', '11 285,11'],
        ['Комиссаровский  сельсовет', '6 113,81', '6 218,21'],
        ['Краснооктябрьский сельсовет', '12 885,31', '13 722,01'],
        ['Марьевский сельсовет', '14 667,31', '15 606,91'],
        ['Нижнегумбетовский сельсовет' , '18 036,91', '20 785,54'],
        ['Новоникитинский сельсовет', '6 047,11', '6 184,31'],
        ['Новотроицкий  сельсовет', '4 179,11', '5 216,71'],
        ['Октябрьский сельсовет', '89 615,10', '93 082,39'],
        ['Российский сельсовет', '5 664,71', '5 808,94'],
        ['Уранбашский  сельсовет', '5 110,01', '5 543,92']]

		for (let subArr of arr2) {
		let div = document.createElement('div');
		div.classList.add('row', 'g2');
		
		for (let elem of subArr) {
			let td = document.createElement('div');
			if (elem!=subArr[0]) {
				td.classList.add('col', 'border', 'border-dark-subtle', 'shadow-sm', 'fs-4', 'g3')
			} else {
			td.classList.add('border-bottom', 'border-dark-subtle', 'col-5', 'fs-6')
			};
			td.textContent = elem;
			div.appendChild(td);
		}
		
		table1.appendChild(div);
	}