let arr1 = [
['Национальная оборона', '7 811', '6 285', '0', '0', '827', '1 656', '221', '413', '1 234', '135', '1 799'],
['Национальная безопасность и правоохранительная деятельность', '6 238', '5 455', '382', '384', '755', '545', '702', '744', '437', '584', '922'],
['Общегосударственные вопросы', '64 879', '48 511', '3 943', '4 491', '6 355', '5 066', '5 485', '5 234', '9 539', '4 157', '4 241'],
['Национальная экономика', '14 993', '9 899', '786', '748', '920', '1 406', '1 410', '1 199', '1 519', '893', '1 016'],
['Жилищно-коммунальное хозяйство', '2 899', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
['Охрана окружающей среды', '350', '85', '0', '0', '0', '0', '85', '0', '0', '0', '0'],
['Образование', '674 336', '519 607', '41 335', '47 184', '45 083', '50 244', '72 706', '51 222', '35 088', '30 473', '146 273'],
['Культура, кинематография', '84 414', '57 405', '4 855', '6 183', '6 129', '8 339', '8 277', '5 854', '6 594', '5 182', '5 993'],
['Здравоохранение', '100', '90', '0', '0', '0', '0', '0', '0', '0', '0', '90'],
['Социальная политика', '36 570', '18 356', '1 181', '4 088', '1 655', '1 290', '1 399', '4 404', '1 218', '1 319', '1 803'],
['Физическая культура и спорт', '33 431', '24 898', '2 000', '3 025', '1 909', '3 189', '2 665', '5 775', '1 684', '2 425', '2 226'],
['Межбюджетные трансферты общего характера бюджетам бюджетной системы российской федерации', '54 037', '43 298', '10 760', '5 380', '5 380', '3 590', '3 590', '3 670', '3 630', '3 590', '3 708']]


let tableExpense = document.querySelector('#tableExpense');

	for (let subArr of arr1) {
		let tr = document.createElement('tr');
		
		for (let elem of subArr) {
			let td = document.createElement('td');
			if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
			td.textContent = elem;
			tr.appendChild(td);
		}
		
		tableExpense.appendChild(tr);
	}