let arr = [
['Налог на доходы физических лиц', '217 351', '218 285,76', '9 300,06', '16 192,01', '10 629,93', '14 417,31', '19 074,82', '20 649,22', '22 949,18', '17 951,79', '20 276,01', '19 144,74', '17 925,10', '29 775,58'],
['Налоги на совокупный доход', '44 972', '45 580,66', '1 425,35', '394,16', '5 974,68', '14 183,86', '3 511,99', '2 875,02', '10 483,88', '660,95', '532,08', '3 971,80', '366,19', '1 200,70'],
['Налоги, сборы и регулярные платежи за пользование природными ресурсами', '25', '29,36', '0,00', '0,00', '0,00', '0,00', '0,00', '0,00', '0,00', '0,00', '7,9', '16,42', '2,70', '2,25'],
['Государственная пошлина', '6 455', '6 638,78', '336,08', '516,41', '474,84', '509,78', '617,81', '454,43', '494,14', '567,49', '800,97', '679,22', '481,17', '706,44'],
['Доходы от использования имущества, находящегося в государственной и муниципальной собственности', '6 160,7', '6 694,62', '31,98', '18,02', '21,55', '320,94', '54,31', '42,02', '313,78', '160,31', '2 414,12', '550,15', '1 393,03', '1 374,38'],
['Платежи при пользовании природными ресурсами', '85,2', '179,91', '10,75', '1,38', '77,44', '27,99', '0,00', '0,00', '29,98', '0,00', '0,00', '32,36', '0,00', '0,00'],
['Доходы от оказания платных услуг и компенсации затрат государства', '373,8', '408,44', '-', '6,39', '10,00', '0,00', '161,91', '10,96', '23,85', '0,00', '160,75', '0,00', '0,00', '34,60'],
['Доходы от продажи материальных и нематериальных активов', '29 413,30', '29 558,12', '3,84', '273,33', '293,69', '10 125,68', '8 739,47', '1,64', '9 258,14', '1,38', '16,80', '261,42', '438,33', '144,40'],
['Штрафы, санкции, возмещение ущерба', '639,8', '1 007,68', '28,51', '51,98', '21,39', '48,62', '54,90', '55,55', '118,38', '77,42', '122,73', '117,94', '84,70', '225,57'],
['Прочие неналоговые доходы', '0,00', '4,01', '0,00', '0,00', '0,00', '0,00', '1,52', '0,00', '0,00', '7,34', '4', '0,00', '0,00', '0,00'],
['Дотации бюджетам бюджетной системы Российской Федерации', '123 997,5', '123 997,36', '14 703,00', '14 703,00', '15 726,00', '7 246,00', '7 810,00', '11 435,00', '7 246,00', '755,00', '6 505,96', '10 936,20', '2 291,00', '24 640,20'],
['Субсидии бюджетам бюджетной системы Российской Федерации (межбюджетные субсидии)', '125 133,1', '124 779,84', '447,45', '5 229,35', '1 391,87', '3 280,39', '5 272,79', '3 581,96', '480,66', '589,54', '98 724,02', '927,04', '2 287,84', '2 566,93'],
['Субвенции бюджетам бюджетной системы Российской Федерации', '365 672,2', '364 014,04', '34 661,74', '29 483,28', '30 304,53', '28 491,07', '45 319,31', '34 805,88', '17 853,59', '16 398,58', '28 960,30', '29 953,04', '27 437,41', '40 345,31'],
['Иные межбюджетные трансферты', '67 959,5', '67 921,51', '6 088,47', '5 926,34', '6 307,19', '6 774,54', '7 826,54', '7 053,49', '5 273,55', '2 264,38', '6 200,91', '6 309,69', '5 311,46', '2 584,95'],
['Прочие безвозмездные поступления', '8 810', '8 810,00', '-', '0,00', '1 200,00', '3 100,00', '0,00', '0,00', '3 200,00', '710,00', '0,00', '3,80', '0,00', '596,20'],
]


let tableIncom = document.querySelector('#tableIncome');

	for (let subArr of arr) {
		let tr = document.createElement('tr');
		
		for (let elem of subArr) {
			let td = document.createElement('td');
			if (elem!=subArr[0]) {td.style.whiteSpace = 'nowrap'};
			td.textContent = elem;
			tr.appendChild(td);
		}
		
		tableIncom.appendChild(tr);
	}